<a href="https://colab.research.google.com/github/dyahrosita/dinasari/blob/main/WEEK6-Homework%201.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## **HOMEWORK 1 - WEEK 6**

Dataframe pertama isinya mengenai nilai dari mahasiswa jurusan statistika. Di dalam dataframe tersebut harus meliputi nama, id mahasiswa, mata kuliah, dan nilainya. Dataframe HARUS dibuat dengan menggunakan dictionary.

In [52]:
import pandas as pd

In [63]:
d1 = {'name' : 'Amelia', 'id' : 10103043,'mata_kuliah' : 'statistika dasar','nilai' : 90}
d2 = {'name' : 'Budi', 'id' : 10102045,'mata_kuliah' : 'metode statistika','nilai' : 85}
d3 = {'name' : 'Chandra', 'id' : 10101050,'mata_kuliah' : 'statistika terapan','nilai' : 75}
d4 = {'name' : 'Dinda', 'id' : 10103040,'mata_kuliah' : 'statistika dasar','nilai' : 95}
d5 = {'name' : 'Emmy', 'id' : 10101019,'mata_kuliah' : 'statistika terapan','nilai' : 70}
d6 = {'name' : 'Farhan', 'id' : 10103059,'mata_kuliah' : 'statistika dasar','nilai' : 90}

d = [d1, d2, d3, d4, d5, d6]

# grouping dictionary by keys
key_names = ['name', 'id', 'mata_kuliah', 'nilai']
new_d = {}
for key in key_names:
  for i in range(len(d)):
    if key not in new_d:
      new_d[key] = []
    new_d[key].append(d[i][key])

# create DataFrame from dictionary
df_dict = pd.DataFrame(new_d, columns=key_names)
df_dict

      name        id         mata_kuliah  nilai
0   Amelia  10103043    statistika dasar     90
1     Budi  10102045   metode statistika     85
2  Chandra  10101050  statistika terapan     75
3    Dinda  10103040    statistika dasar     95
4     Emmy  10101019  statistika terapan     70
5   Farhan  10103059    statistika dasar     90

Dataframe kedua isinya adalah kumpulan informasi hewan di kebun binatang. Informasi yang diperlukan adalah jenis hewan, nama panggilan, kapan dilahirkan, usia, dan jenis kelamin. Dataframe HARUS dibuat dengan menggunakan tuple.

In [68]:
t1 = ('Harimau', 'Harry', '2018-08-14', 2, 'Jantan')
t2 = ('Jerapah', 'Jerry', '2017-12-12', 3, 'Jantan')
t3 = ('Rusa', 'Risa', '2019-01-10', 2, 'Betina')
t4 = ('Zebra', 'Zera', '2016-11-10', 4, 'Betina')
t5 = ('Buaya', 'Bu Aya', '2013-10-23', 7, 'Betina')
t = [t1, t2, t3, t4, t5]
column_names = ['jenis_hewan', 'nama_panggilan', 'tanggal_lahir', 'usia(thn)', 'jenis_kelamin']

#create DataFrame from tuple
df_tuple = pd.DataFrame(my_tuple, columns = column_names) 
df_tuple

  jenis_hewan nama_panggilan tanggal_lahir  usia(thn) jenis_kelamin
0     Harimau          Harry    2018-08-14          2        Jantan
1     Jerapah          Jerry    2017-12-12          3        Jantan
2        Rusa           Risa    2019-01-10          2        Betina
3       Zebra           Zera    2016-11-10          4        Betina
4       Buaya         Bu Aya    2013-10-23          7        Betina